<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
  <title>Analysetools - Glosssar</title></head>

<body>
<a href="../../index.html">&rarr; Index</a>
<h1>Glossar &amp; Akronyme</h1>
<hr>
<dl>
  <dt><strong><a name="ESC"></a>ESC &ndash; <u>e</u>ffective <u>s</u>eries <u>c</u>apacity, effektive Serienkapazit&auml;t</strong></dt>
  <dd>Das ist ein gedachter, in Serie geschalteter Kondensator einer
komplexen Impedanz. Er stellt den (negativen) Imagin&auml;rteil
der&nbsp;Impedanz dar und ist im allgemeinen frequenzabh&auml;ngig. Die
Angabe der ESC ist&nbsp;nur sinnvoll, wenn der Imagin&auml;rteil der
Impedanz negativ ist.</dd>
  <dt><strong><a name="ESC"></a>ESL &ndash; <u>e</u>ffective <u>s</u>eries Inductivity (<u>L</u>), effektive Serieninduktivit&auml;t</strong></dt>
  <dd>Das ist eine gedachte, in Serie geschaltete Spule einer
komplexen Impedanz. Sie stellt den (positiven) Imagin&auml;rteil der
Impedanz dar und ist im allgemeinen frequenzabh&auml;ngig. Die Angabe
der ESL ist nur sinnvoll, wenn der Imagin&auml;rteil der Impedanz
positiv ist.</dd>
  <dt><strong><a name="ESR"></a>ESR &ndash;<u>e</u>ffective <u>s</u>eries <u>r</u>esistance, effektiver Serienwiderstand </strong></dt>
  <dd> Das ist ein gedachter Serienwiderstand einer komplexen
Impedanz. Er stellt den Realteil der Impedanz dar und ist im
allgemeinen frequenzabh&auml;ngig.</dd>
  <dt><strong><a name="window_function"></a>Fensterfunktion</strong></dt>
  <dd>Eine Fensterfunktion wird eingesetzt, um aus einem
kontinuierlichem Strom an Messwerten eine m&ouml;glichst kleine Zahl an
Messpunkten so herauszufischen, dass dabei das Frequenzspektrum des
Originalsignals m&ouml;glichst scharf erhalten bleibt. Letztlich
l&auml;uft das immer auf ein mehr oder minder sanftes "Einblenden" der
Amplituden gefolgt von einem ebenso sanften "Ausblenden" hinaus. Eine
Fensterfunktion ist immer dann erforderlich, wenn eine
Fourier-Transformation eines endlich langen Ausschnitts eines
nichtperiodischen Signals gemacht werden muss.</dd>
  <dt><strong><a name="DFT"></a></strong><strong>DFT  <u>d</u>iscrete <u>f</u>ourier <u>t</u>ransform, diskrete Fourier-Transformation</strong></dt>
  <dd>Methode zur Zerlegung einer endlichen Zahl (zeitlich) aufeinanderfolgender Messpunkte in ein diskretes Frequenzspektrum.</dd>
  <dt><strong><a name="LCR"></a>LCR-Messung</strong></dt>
  <dd>K&uuml;rzel f&uuml;r eine simultane Messung von Induktivit&auml;t (<u>L</u>), Kapazit&auml;t (<u>C</u>) und Widerstand (<u>R</u>). Eine komplexe Impedanz Z wird dabei als gedachte Serienschaltung einer idealen Spule (<a href="#ESL">ESL</a>), eines idealen Kondesators (<a href="#ESC">ESC</a>) und eines idealen Widerstands (<a href="#ESR">ESR</a>) dargestellt. Die Parameter sind frequenzabh&auml;ngig. Bei einer Frequenz ist immer nur ESC oder ESL wirksam.</dd>
  <dt><strong><a name="MLS"></a>MLS &ndash; <u>M</u>aximum <u>L</u>ength <u>S</u>equence</strong></dt>
  <dd>Die ist ein dem Rauschen &auml;hnliches Signal, das sich aber
nach einer bestimmten Zeit exakt wiederholt. Dadurch ist das
Frequenzspektrum diskret und eignet sich besonders f&uuml;r die Analyse
mit Hilfe der DFT, da in diesem Fall keine Fensterfunktion erforderlich
ist.<br>
Im Zusammenhang dieser Software kommen der MLS &auml;hnliche
Signale&nbsp;mit eingeschr&auml;nkten und gewichteten Frequenzspektren
zum Einsatz. Die Generierung der Rauschsignale erfolgt mit dem Programm
<tt><a href="noise.html">noise</a></tt>.</dd>
  <dt><strong><a name="PCA"></a>PCA &ndash;<u>P</u>rincipal <u>C</u>omponent <u>A</u>nalysis</strong></dt>
  <dd>Dies ist eine lineare Analysemethode, die versucht eine
Funktion durch eine Linearkombination aus einem Satz gegebener
Funktionen nachzubilden. Die einzelnen Anteile werden dabei so
gew&auml;hlt, dass die Summe der quadrierte Abweichungen minimal wird.
Mathematisch gesehen entspricht das einer linearen Anpassung (Fit), der mit Hilfe
der Pseudoinversen der Koeffizientenmatrix&nbsp;berechnet wird. Im
Gegensatz zur klassischen Anpassung mit einer Modellfunktion m&uuml;ssen die Basisfunktionen nicht
geschlossen darstellbar sein, sondern k&ouml;nnen selbst Messwerte sein.</dd>
</dl>
<hr>
</body></html>